Revit 2024 API
ElectricalLoadClassification.Motor Property
 Indicates if this load classification is to be used for motors.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool Motor { get; }
Visual Basic
Public ReadOnly Property Motor As Boolean
	Get
Visual C++
public:
property bool Motor {
	bool get ();
}
See Also
ElectricalLoadClassification Class
Autodesk.Revit.DB.Electrical Namespace